import pytest
from functions.scrapping.get_dormitory import Dormitory, get_time_of_day


# Dormitory 클래스의 get_menu 메서드를 테스트합니다.

def test_get_menu():
    dorm = Dormitory("20240325")
    menu = dorm.get_menu()

    # 2024년 3월 25일의 기숙사 식당 메뉴가 다음과 같은지 확인합니다.
    # [{'date': '20240325', 'restaurant': '기숙사식당',
    #   'menu': {'조식': ['어묵국', '쌀밥', '어니언링떡갈비', '멸치볶음/요플레', '구이김', '배추김치', '계란후라이'],
    #            '중식': ['(쌈밥데이)', '김치콩나물국/쌀밥', '돈육소금구이', '오징어볼강정', '모듬쌈/쌈장', '백김치', '콜라'],
    #            '석식': ['참치김치볶음밥', '우동장국', '치킨너겟&허니s', '마카로니콘범벅', '단무지무침', '배추김치', '요구르트']}},
    #  {'date': '20240326', 'restaurant': '기숙사식당',
    #   'menu': {'조식': ['배추된장국', '쌀밥', '오징어볶음', '소시지구이', '구이김', '배추김치', '계란후라이'],
    #            '중식': ['사골미역국', '쌀밥&흑미밥', '큐브목살김치찜', '왕찐만두&양념장', '콩나물무침', '구이김', '요구르트'],
    #            '석식': ['까르보나라스파게티', '미소장국', '쌀밥', '사천식치킨까스', '오리엔탈그린샐러드', '배추김치', '요구르트']}},
    #  {'date': '20240327', 'restaurant': '기숙사식당',
    #   'menu': {'조식': ['북어국', '쌀밥', '미니돈까스&샐러드', '어묵야채볶음', '구이김', '배추김치', '계란후라이'],
    #            '중식': ['얼큰순두부찌개', '쌀밥/흑미밥', '안동찜닭', '탕수육강정', '돈나물/초장', '깍두기', '요구르트'],
    #            '석식': ['가츠동', '콩나물국/추가밥', '밀떡볶이', '찐순대&소금장', '깍뚝단무지', '배추김치', '요구르트']}},
    #  {'date': '20240328', 'restaurant': '기숙사식당',
    #   'menu': {'조식': ['미역국', '쌀밥', '두부간장조림', '감자고로케&케찹', '구이김', '배추김치', '계란후라이'],
    #            '중식': ['닭개장/당면사리', '쌀밥&흑미밥', '김치전&부추전', '꿀고구마맛탕', '쌈다시마&양배추찜', '배추김치', '요구르트'],
    #            '석식': ['수제비짬뽕탕(大)', '쌀밥', '생선까스&사우전s', '비엔나야채볶음', '무짠지무침', '배추김치', '요구르트']}},
    #  {'date': '20240329', 'restaurant': '기숙사식당',
    #   'menu': {'조식': ['김치콩나물국', '쌀밥', '메밀전병', '명엽채볶음', '구이김', '배추김치', '계란후라이'],
    #            '중식': ['스팸계란볶음밥', '어묵국', '눈꽃치즈함박스테이크', '망고샐러드', '꼬들단무지/오복지', '배추김치', '요구르트'],
    #            '석식': ['미소라멘/핫도그', '쌀밥', '춘권,사모사', '콥샐러드', '와사비쌈무', '배추김치', '요구르트']}},
    #  {'date': '20240330', 'restaurant': '기숙사식당',
    #   'menu': {'조식': ['주말 조식은 운영하지 않습니다.'], '중식': ['콩나물국', '쌀밥', '돈까스&감자튀김', '푸질리토마토파스타', '치커리유자샐러드', '배추김치', '요구르트'],
    #            '석식': ['대파계란국', '쌀밥', '닭살바베큐볶음', '비빔만두', '무짠지무침', '배추김치', '요구르트']}},
    #  {'date': '20240331', 'restaurant': '기숙사식당',
    #   'menu': {'조식': ['주말 조식은 운영하지 않습니다.'], '중식': ['얼큰김치찌개', '쌀밥', '제육간장불고기', '해물동그랑땡폭찹', '멕시칸콘마요', '배추김치', '요구르트'],
    #            '석식': ['떡국', '쌀밥', '브로컬리떡갈비', '찐만두&양념장', '고추지무침', '배추김치', '요구르트']}}]
    # {'date': '20240325', 'menu': {'조식': ['운영'], '중식': ['운영'], '석식': ['운영']}}
    assert menu[0]["date"] == "20240325" and menu[0]["menu"]["조식"] == ['어묵국', '쌀밥', '어니언링떡갈비', '멸치볶음/요플레', '구이김',
                                                                       '배추김치', '계란후라이'] and menu[6][
               "date"] == "20240331" and menu[6]["menu"]["석식"] == ['떡국', '쌀밥', '브로컬리떡갈비', '찐만두&양념장', '고추지무침', '배추김치',
                                                                   '요구르트']
def test_get_time_of_day():
    assert get_time_of_day("조식") == "MORNING" and get_time_of_day("중식") == "LUNCH" and get_time_of_day("석식") == "DINNER"

def test_get_dormitory_from_ssudorm():
    dorm = Dormitory("20240325")
    response = dorm.get_dormitory_from_ssudorm()
    assert response.status_code == 200

